experiments/actual-usage-evictor-v2/lnu/results/l1-load/20260614-183116/api-load.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/ubuntu/descheduler-custom/experiments/actual-usage-evictor-v2/k6/api-load.js
        output: json (/home/ubuntu/descheduler-custom/experiments/actual-usage-evictor-v2/lnu/results/l1-load/20260614-183116/api-load.json)

     scenarios: (100.00%) 1 scenario, 160 max VUs, 8m30s max duration (incl. graceful stop):
              * api: 8.00 iterations/s for 8m0s (maxVUs: 60-160, gracefulStop: 30s)


running (0m00.9s), 001/060 VUs, 7 complete and 0 interrupted iterations
api    [   0% ] 001/060 VUs  0m00.9s/8m0s  8.00 iters/s

running (0m01.9s), 001/060 VUs, 15 complete and 0 interrupted iterations
api    [   0% ] 001/060 VUs  0m01.9s/8m0s  8.00 iters/s

running (0m02.9s), 001/060 VUs, 23 complete and 0 interrupted iterations
api    [   1% ] 001/060 VUs  0m02.9s/8m0s  8.00 iters/s

running (0m03.9s), 001/060 VUs, 31 complete and 0 interrupted iterations
api    [   1% ] 001/060 VUs  0m03.9s/8m0s  8.00 iters/s

running (0m04.9s), 001/060 VUs, 39 complete and 0 interrupted iterations
api    [   1% ] 001/060 VUs  0m04.9s/8m0s  8.00 iters/s

running (0m05.9s), 001/060 VUs, 47 complete and 0 interrupted iterations
api    [   1% ] 001/060 VUs  0m05.9s/8m0s  8.00 iters/s

running (0m06.9s), 001/060 VUs, 55 complete and 0 interrupted iterations
api    [   1% ] 001/060 VUs  0m06.9s/8m0s  8.00 iters/s

running (0m07.9s), 001/060 VUs, 63 complete and 0 interrupted iterations
api    [   2% ] 001/060 VUs  0m07.9s/8m0s  8.00 iters/s

running (0m08.9s), 001/060 VUs, 71 complete and 0 interrupted iterations
api    [   2% ] 001/060 VUs  0m08.9s/8m0s  8.00 iters/s

running (0m09.9s), 001/060 VUs, 79 complete and 0 interrupted iterations
api    [   2% ] 001/060 VUs  0m09.9s/8m0s  8.00 iters/s

running (0m10.9s), 001/060 VUs, 87 complete and 0 interrupted iterations
api    [   2% ] 001/060 VUs  0m10.9s/8m0s  8.00 iters/s

running (0m11.9s), 001/060 VUs, 95 complete and 0 interrupted iterations
api    [   2% ] 001/060 VUs  0m11.9s/8m0s  8.00 iters/s

running (0m12.9s), 001/060 VUs, 103 complete and 0 interrupted iterations
api    [   3% ] 001/060 VUs  0m12.9s/8m0s  8.00 iters/s

running (0m13.9s), 001/060 VUs, 111 complete and 0 interrupted iterations
api    [   3% ] 001/060 VUs  0m13.9s/8m0s  8.00 iters/s

running (0m14.9s), 001/060 VUs, 119 complete and 0 interrupted iterations
api    [   3% ] 001/060 VUs  0m14.9s/8m0s  8.00 iters/s

running (0m15.9s), 001/060 VUs, 127 complete and 0 interrupted iterations
api    [   3% ] 001/060 VUs  0m15.9s/8m0s  8.00 iters/s

running (0m16.9s), 001/060 VUs, 135 complete and 0 interrupted iterations
api    [   4% ] 001/060 VUs  0m16.9s/8m0s  8.00 iters/s

running (0m17.9s), 001/060 VUs, 143 complete and 0 interrupted iterations
api    [   4% ] 001/060 VUs  0m17.9s/8m0s  8.00 iters/s

running (0m18.9s), 001/060 VUs, 151 complete and 0 interrupted iterations
api    [   4% ] 001/060 VUs  0m18.9s/8m0s  8.00 iters/s

running (0m19.9s), 001/060 VUs, 159 complete and 0 interrupted iterations
api    [   4% ] 001/060 VUs  0m19.9s/8m0s  8.00 iters/s

running (0m20.9s), 001/060 VUs, 167 complete and 0 interrupted iterations
api    [   4% ] 001/060 VUs  0m20.9s/8m0s  8.00 iters/s

running (0m21.9s), 001/060 VUs, 175 complete and 0 interrupted iterations
api    [   5% ] 001/060 VUs  0m21.9s/8m0s  8.00 iters/s

running (0m22.9s), 001/060 VUs, 183 complete and 0 interrupted iterations
api    [   5% ] 001/060 VUs  0m22.9s/8m0s  8.00 iters/s

running (0m23.9s), 001/060 VUs, 191 complete and 0 interrupted iterations
api    [   5% ] 001/060 VUs  0m23.9s/8m0s  8.00 iters/s

running (0m24.9s), 001/060 VUs, 199 complete and 0 interrupted iterations
api    [   5% ] 001/060 VUs  0m24.9s/8m0s  8.00 iters/s

running (0m25.9s), 001/060 VUs, 207 complete and 0 interrupted iterations
api    [   5% ] 001/060 VUs  0m25.9s/8m0s  8.00 iters/s

running (0m26.9s), 001/060 VUs, 215 complete and 0 interrupted iterations
api    [   6% ] 001/060 VUs  0m26.9s/8m0s  8.00 iters/s

running (0m27.9s), 001/060 VUs, 223 complete and 0 interrupted iterations
api    [   6% ] 001/060 VUs  0m27.9s/8m0s  8.00 iters/s

running (0m28.9s), 001/060 VUs, 231 complete and 0 interrupted iterations
api    [   6% ] 001/060 VUs  0m28.9s/8m0s  8.00 iters/s

running (0m29.9s), 001/060 VUs, 239 complete and 0 interrupted iterations
api    [   6% ] 001/060 VUs  0m29.9s/8m0s  8.00 iters/s

running (0m30.9s), 001/060 VUs, 247 complete and 0 interrupted iterations
api    [   6% ] 001/060 VUs  0m30.9s/8m0s  8.00 iters/s

running (0m31.9s), 001/060 VUs, 255 complete and 0 interrupted iterations
api    [   7% ] 001/060 VUs  0m31.9s/8m0s  8.00 iters/s

running (0m32.9s), 001/060 VUs, 263 complete and 0 interrupted iterations
api    [   7% ] 001/060 VUs  0m32.9s/8m0s  8.00 iters/s

running (0m33.9s), 001/060 VUs, 271 complete and 0 interrupted iterations
api    [   7% ] 001/060 VUs  0m33.9s/8m0s  8.00 iters/s

running (0m34.9s), 001/060 VUs, 279 complete and 0 interrupted iterations
api    [   7% ] 001/060 VUs  0m34.9s/8m0s  8.00 iters/s

running (0m35.9s), 001/060 VUs, 287 complete and 0 interrupted iterations
api    [   7% ] 001/060 VUs  0m35.9s/8m0s  8.00 iters/s

running (0m36.9s), 001/060 VUs, 295 complete and 0 interrupted iterations
api    [   8% ] 001/060 VUs  0m36.9s/8m0s  8.00 iters/s

running (0m37.9s), 001/060 VUs, 303 complete and 0 interrupted iterations
api    [   8% ] 001/060 VUs  0m37.9s/8m0s  8.00 iters/s

running (0m38.9s), 001/060 VUs, 311 complete and 0 interrupted iterations
api    [   8% ] 001/060 VUs  0m38.9s/8m0s  8.00 iters/s

running (0m39.9s), 001/060 VUs, 319 complete and 0 interrupted iterations
api    [   8% ] 001/060 VUs  0m39.9s/8m0s  8.00 iters/s

running (0m40.9s), 001/060 VUs, 327 complete and 0 interrupted iterations
api    [   9% ] 001/060 VUs  0m40.9s/8m0s  8.00 iters/s

running (0m41.9s), 001/060 VUs, 335 complete and 0 interrupted iterations
api    [   9% ] 001/060 VUs  0m41.9s/8m0s  8.00 iters/s

running (0m42.9s), 001/060 VUs, 343 complete and 0 interrupted iterations
api    [   9% ] 001/060 VUs  0m42.9s/8m0s  8.00 iters/s

running (0m43.9s), 001/060 VUs, 351 complete and 0 interrupted iterations
api    [   9% ] 001/060 VUs  0m43.9s/8m0s  8.00 iters/s

running (0m44.9s), 001/060 VUs, 359 complete and 0 interrupted iterations
api    [   9% ] 001/060 VUs  0m44.9s/8m0s  8.00 iters/s

running (0m45.9s), 001/060 VUs, 367 complete and 0 interrupted iterations
api    [  10% ] 001/060 VUs  0m45.9s/8m0s  8.00 iters/s

running (0m46.9s), 001/060 VUs, 375 complete and 0 interrupted iterations
api    [  10% ] 001/060 VUs  0m46.9s/8m0s  8.00 iters/s

running (0m47.9s), 002/060 VUs, 382 complete and 0 interrupted iterations
api    [  10% ] 002/060 VUs  0m47.9s/8m0s  8.00 iters/s

running (0m48.9s), 008/060 VUs, 384 complete and 0 interrupted iterations
api    [  10% ] 008/060 VUs  0m48.9s/8m0s  8.00 iters/s

running (0m49.9s), 014/060 VUs, 386 complete and 0 interrupted iterations
api    [  10% ] 014/060 VUs  0m49.9s/8m0s  8.00 iters/s

running (0m50.9s), 011/060 VUs, 397 complete and 0 interrupted iterations
api    [  11% ] 011/060 VUs  0m50.9s/8m0s  8.00 iters/s

running (0m51.9s), 009/060 VUs, 407 complete and 0 interrupted iterations
api    [  11% ] 009/060 VUs  0m51.9s/8m0s  8.00 iters/s

running (0m52.9s), 009/060 VUs, 415 complete and 0 interrupted iterations
api    [  11% ] 009/060 VUs  0m52.9s/8m0s  8.00 iters/s

running (0m53.9s), 008/060 VUs, 424 complete and 0 interrupted iterations
api    [  11% ] 008/060 VUs  0m53.9s/8m0s  8.00 iters/s

running (0m54.9s), 007/060 VUs, 433 complete and 0 interrupted iterations
api    [  11% ] 007/060 VUs  0m54.9s/8m0s  8.00 iters/s

running (0m55.9s), 005/060 VUs, 443 complete and 0 interrupted iterations
api    [  12% ] 005/060 VUs  0m55.9s/8m0s  8.00 iters/s

running (0m56.9s), 004/060 VUs, 452 complete and 0 interrupted iterations
api    [  12% ] 004/060 VUs  0m56.9s/8m0s  8.00 iters/s

running (0m57.9s), 002/060 VUs, 462 complete and 0 interrupted iterations
api    [  12% ] 002/060 VUs  0m57.9s/8m0s  8.00 iters/s

running (0m58.9s), 001/060 VUs, 471 complete and 0 interrupted iterations
api    [  12% ] 001/060 VUs  0m58.9s/8m0s  8.00 iters/s

running (0m59.9s), 001/060 VUs, 479 complete and 0 interrupted iterations
api    [  12% ] 001/060 VUs  0m59.9s/8m0s  8.00 iters/s

running (1m00.9s), 001/060 VUs, 487 complete and 0 interrupted iterations
api    [  13% ] 001/060 VUs  1m00.9s/8m0s  8.00 iters/s

running (1m01.9s), 001/060 VUs, 495 complete and 0 interrupted iterations
api    [  13% ] 001/060 VUs  1m01.9s/8m0s  8.00 iters/s

running (1m02.9s), 001/060 VUs, 503 complete and 0 interrupted iterations
api    [  13% ] 001/060 VUs  1m02.9s/8m0s  8.00 iters/s

running (1m03.9s), 001/060 VUs, 511 complete and 0 interrupted iterations
api    [  13% ] 001/060 VUs  1m03.9s/8m0s  8.00 iters/s

running (1m04.9s), 001/060 VUs, 519 complete and 0 interrupted iterations
api    [  14% ] 001/060 VUs  1m04.9s/8m0s  8.00 iters/s

running (1m05.9s), 001/060 VUs, 527 complete and 0 interrupted iterations
api    [  14% ] 001/060 VUs  1m05.9s/8m0s  8.00 iters/s

running (1m06.9s), 001/060 VUs, 535 complete and 0 interrupted iterations
api    [  14% ] 001/060 VUs  1m06.9s/8m0s  8.00 iters/s

running (1m07.9s), 001/060 VUs, 543 complete and 0 interrupted iterations
api    [  14% ] 001/060 VUs  1m07.9s/8m0s  8.00 iters/s

running (1m08.9s), 001/060 VUs, 551 complete and 0 interrupted iterations
api    [  14% ] 001/060 VUs  1m08.9s/8m0s  8.00 iters/s

running (1m09.9s), 001/060 VUs, 559 complete and 0 interrupted iterations
api    [  15% ] 001/060 VUs  1m09.9s/8m0s  8.00 iters/s

running (1m10.9s), 001/060 VUs, 567 complete and 0 interrupted iterations
api    [  15% ] 001/060 VUs  1m10.9s/8m0s  8.00 iters/s

running (1m11.9s), 001/060 VUs, 575 complete and 0 interrupted iterations
api    [  15% ] 001/060 VUs  1m11.9s/8m0s  8.00 iters/s

running (1m12.9s), 001/060 VUs, 583 complete and 0 interrupted iterations
api    [  15% ] 001/060 VUs  1m12.9s/8m0s  8.00 iters/s

running (1m13.9s), 001/060 VUs, 591 complete and 0 interrupted iterations
api    [  15% ] 001/060 VUs  1m13.9s/8m0s  8.00 iters/s

running (1m14.9s), 001/060 VUs, 599 complete and 0 interrupted iterations
api    [  16% ] 001/060 VUs  1m14.9s/8m0s  8.00 iters/s

running (1m15.9s), 001/060 VUs, 607 complete and 0 interrupted iterations
api    [  16% ] 001/060 VUs  1m15.9s/8m0s  8.00 iters/s

running (1m16.9s), 001/060 VUs, 615 complete and 0 interrupted iterations
api    [  16% ] 001/060 VUs  1m16.9s/8m0s  8.00 iters/s

running (1m17.9s), 001/060 VUs, 623 complete and 0 interrupted iterations
api    [  16% ] 001/060 VUs  1m17.9s/8m0s  8.00 iters/s

running (1m18.9s), 001/060 VUs, 631 complete and 0 interrupted iterations
api    [  16% ] 001/060 VUs  1m18.9s/8m0s  8.00 iters/s

running (1m19.9s), 001/060 VUs, 639 complete and 0 interrupted iterations
api    [  17% ] 001/060 VUs  1m19.9s/8m0s  8.00 iters/s

running (1m20.9s), 001/060 VUs, 647 complete and 0 interrupted iterations
api    [  17% ] 001/060 VUs  1m20.9s/8m0s  8.00 iters/s

running (1m21.9s), 001/060 VUs, 655 complete and 0 interrupted iterations
api    [  17% ] 001/060 VUs  1m21.9s/8m0s  8.00 iters/s

running (1m22.9s), 001/060 VUs, 663 complete and 0 interrupted iterations
api    [  17% ] 001/060 VUs  1m22.9s/8m0s  8.00 iters/s

running (1m23.9s), 001/060 VUs, 671 complete and 0 interrupted iterations
api    [  17% ] 001/060 VUs  1m23.9s/8m0s  8.00 iters/s

running (1m24.9s), 001/060 VUs, 679 complete and 0 interrupted iterations
api    [  18% ] 001/060 VUs  1m24.9s/8m0s  8.00 iters/s

running (1m25.9s), 001/060 VUs, 687 complete and 0 interrupted iterations
api    [  18% ] 001/060 VUs  1m25.9s/8m0s  8.00 iters/s

running (1m26.9s), 001/060 VUs, 695 complete and 0 interrupted iterations
api    [  18% ] 001/060 VUs  1m26.9s/8m0s  8.00 iters/s

running (1m27.9s), 001/060 VUs, 703 complete and 0 interrupted iterations
api    [  18% ] 001/060 VUs  1m27.9s/8m0s  8.00 iters/s

running (1m28.9s), 001/060 VUs, 711 complete and 0 interrupted iterations
api    [  19% ] 001/060 VUs  1m28.9s/8m0s  8.00 iters/s

running (1m29.9s), 001/060 VUs, 719 complete and 0 interrupted iterations
api    [  19% ] 001/060 VUs  1m29.9s/8m0s  8.00 iters/s

running (1m30.9s), 001/060 VUs, 727 complete and 0 interrupted iterations
api    [  19% ] 001/060 VUs  1m30.9s/8m0s  8.00 iters/s

running (1m31.9s), 001/060 VUs, 735 complete and 0 interrupted iterations
api    [  19% ] 001/060 VUs  1m31.9s/8m0s  8.00 iters/s

running (1m32.9s), 001/060 VUs, 743 complete and 0 interrupted iterations
api    [  19% ] 001/060 VUs  1m32.9s/8m0s  8.00 iters/s

running (1m33.9s), 001/060 VUs, 751 complete and 0 interrupted iterations
api    [  20% ] 001/060 VUs  1m33.9s/8m0s  8.00 iters/s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.20' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 756     8.000991/s
    checks_succeeded...: 100.00% 756 out of 756
    checks_failed......: 0.00%   0 out of 756

    ✓ api status 200

    HTTP
    http_req_duration..............: avg=163.89ms min=60.6ms  med=62.08ms max=1.96s p(90)=339.08ms p(95)=1.08s
      { expected_response:true }...: avg=163.89ms min=60.6ms  med=62.08ms max=1.96s p(90)=339.08ms p(95)=1.08s
    http_req_failed................: 0.00%  0 out of 756
    http_reqs......................: 756    8.000991/s

    EXECUTION
    iteration_duration.............: avg=164.28ms min=60.85ms med=62.44ms max=1.96s p(90)=339.35ms p(95)=1.08s
    iterations.....................: 756    8.000991/s
    vus............................: 1      min=1        max=14
    vus_max........................: 60     min=60       max=60

    NETWORK
    data_received..................: 214 kB 2.3 kB/s
    data_sent......................: 83 kB  880 B/s



running (1m34.5s), 000/060 VUs, 756 complete and 0 interrupted iterations
api  ✗ [  20% ] 000/060 VUs  1m34.5s/8m0s  8.00 iters/s
time="2026-06-14T18:33:48Z" level=error msg="test run was aborted because k6 received a 'interrupt' signal"